# 1  Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# numbers[2] = 99
# print(numbers) # [1, 2, 99, 4, 5]

# 2 Что покажет приведенный ниже фрагмент кода?

# numbers = list(range(3))
# print(numbers) # [0, 1, 2]

# 3  Что покажет приведенный ниже фрагмент кода?

# numbers = [10] * 5
# print(numbers) # [10, 10, 10, 10, 10]

# 4  Что покажет приведенный ниже фрагмент кода?

# numbers = list(range(1, 10, 2))
# for i in numbers:
#     print(i, end="*") # 1*3*5*7*9*

# 5 Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# print(numbers[-2]) # 4

# 6  Что покажет приведенный ниже фрагмент кода?

# numbers1 = [1, 2, 3]
# numbers2 = [10, 20, 30]
# numbers3 = numbers1 + numbers2
# print(numbers3) # [1, 2, 3, 10, 20, 30]

# 7 Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# my_list = numbers[1:3]
# print(my_list)  # [2, 3]

# 8 Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# my_list = numbers[1:]
# print(my_list)  # [2, 3, 4, 5]

# 9 Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# my_list = numbers[:-1]
# print(my_list)  # [1, 2, 3, 4]

# 10 Что покажет приведенный ниже фрагмент кода?

# numbers = [1, 2, 3, 4, 5]
# my_list = numbers[:]
# print(my_list) # [1, 2, 3, 4, 5]

# 11 Что покажет приведенный ниже фрагмент кода?

# names = ["Джим", "Джилл", "Джон", "Джасмин"]
# if "Джасмин" not in names:
#     print("Не могу найти Джасмин.")
# else:
#     print("Ceмья Джасмин: ", end="")
#     print(names) # Ceмья Джасмин: ['Джим', 'Джилл', 'Джон', 'Джасмин']

# 12 Какая из приведенных функций возвращает длину списка?

#  len()

# 13 Какая из приведенных функций возвращает самое большое значение в списке?

# max()

# 14 Какой из приведенных методов добавляет значение в конец существующего списка?

# append()

# 15 В результате применения инструкции del значение в заданной индексной позиции удаляется из списка.
